farmharness/integration/mutants/daemon-hidden-wire-skew.patch
diff --git a/cache/p50_endpoint.cpp b/cache/p50_endpoint.cpp
index 0000000..0000000 100644
--- a/cache/p50_endpoint.cpp
+++ b/cache/p50_endpoint.cpp
@@ -19,6 +19,7 @@
 #include <array>
 #include <atomic>
 #include <cerrno>
+#include <cstdlib>
 #include <chrono>
 #include <fcntl.h>
 #include <limits>
@@ -4038,6 +4039,22 @@ boost::asio::awaitable<ServerRunResult> P50ServerEndpoint::run_connected(
             hello.c_store_guid != *expected_c_store_guid)
             throw std::invalid_argument(
                 "SESSION_HELLO differs from the adopted P5CO claim");
+        // S90 integration mutant: keep the ordinary revision-1 scheduler
+        // advertisement, but make this endpoint negotiate as revision 2.
+        // The real negotiation path must emit WIRE_REVISION_MISMATCH; the
+        // client must then request one fresh remote legacy assignment.
+        if (const char* configured =
+                std::getenv("ICECC_P50_S90_ENDPOINT_WIRE_REVISION");
+            configured != nullptr) {
+            if (std::string_view(configured) != "2")
+                throw std::invalid_argument(
+                    "S90 endpoint revision mutant requires revision 2");
+            (void)negotiate_session(
+                hello, static_cast<uint16_t>(kP50WireRevision + 1),
+                impl_->caps.supported_profiles, impl_->caps.wire);
+            throw std::logic_error(
+                "S90 endpoint revision mutant failed to refuse the mismatch");
+        }
         result.c_store_guid = hello.c_store_guid;
         reply_cap = std::min(reply_cap, hello.limits.max_frame_payload);
         const SessionSelection selection =
